if not(GetLocale() == "koKR") then
  return
end
local L = FGI.L

-- FAQ
L["help"] = {
	["factorySettings"] = "/fgi factorySettings - 전체 애드온 데이터베이스 재설정",
	["filter"] = "LMB - 사용함/사용안함\n PMM - 수정\nShift+LMB - 이동\n\n",
	["filterTooltip"] = "필터 이름:%s\n상태:%s\n필터 이름:%s\n레벨 범위:%s\n 이름에 필터 반복:%u:%u\n 클래스:%s\n특징::%s\n 필터 응답 수:%u",
	["minimap"] = "LMB - 초대\n PM - 기본 창을 엽니다.\n Shift+LMB-일시 중지/계속\n\n 변경:%u\n 진행:%s",
	["resetDB"] = "/fgi resetDB - 보낸 초대장 목록을 지웁니다.",
	["resetWindowsPos"] = "/fgi resetWindowsPos - 창 위치를 재설정합니다.",
	["show"] = "/fgi show - 추가 기능 기본 창 열기",
}
L["error"] = {
	["Вы не состоите в гильдии или у вас нет прав для приглашения."] = "님은 길드원이 아니거나 초대 할 권한이 없습니다.",
	["Выберите сообщение"] = "메시지 선택",
	["Максимальное количество фильтров %s. Пожалуйста измените или удалите имеющийся фильтр."] = "최대 필터 수는 %s입니다. 기존 필터를 변경하거나 제거하십시오.",
	["Нельзя добавить пустое сообщение"] = "빈 메시지를 추가 할 수 없습니다.",
	["Нельзя сохранить пустое сообщение"] = "빈 메시지를 저장할 수 없습니다.",
	["Поиск вернул 50 или более результатов, рекомендуется изменить настройки поиска. Запрос: %s"] = "검색 결과가 50 개 이상 검색되었습니다. 검색 설정을 변경하는 것이 좋습니다. 요청: %s",
}

-- interface
L["Включен"] = "켜기"
L["Включить фильтры"] = "필터 사용"
L["Выбрать приглашения"] = "초대장 선택"
L["Выключен"] = "끄기"
L["Выключить отправляемые сообщения"] = "보낸 메시지 사용 안 함"
L["Выключить системные сообщения"] = "시스템 메시지 끄기"
L["Выключить сообщения аддона"] = "애드온 메시지 사용 중지"
L["Да"] = "예"
L["Диапазон уровней"] = "레벨 범위"
L["Диапазон уровней (Мин:Макс)"] = "레벨 범위 (최소:최대)"
L["Добавить"] = "추가"
L["Добавить фильтр"] = "필터 추가"
L["Запускать в фоновом режиме"] = "백그라운드에서 실행"
L["Игнорировать"] = "무시"
L["Имя фильтра"] = "필터 이름"
L["Имя фильтра занято"] = "필터 이름이 사용 중입니다."
L["Имя фильтра не может быть пустым"] = "필터 이름은 비워 둘 수 없습니다."
L["Интервал"] = "간격"
L["Классы:"] = "클래스:"
L["Количество ошибок: %u"] = "오류 수: %u"
L["Нажмите на фильтр для изменения состояния"] = "필터를 클릭하여 상태를 변경하십시오."
L["Назначить кнопку (%s)"] = "할당 버튼 (%s)"
L["Настроить сообщения"] = "소식 맞춤 설정"
L["Настройки"] = "설정"
L["Начать сканирование"] = "스캔 시작"
L["Не отображать значок у миникарты"] = "미니 맵에 아이콘을 표시하지 마십시오."
L["Неправильный шаблон"] = "잘못된 템플릿"
L["Нет"] = "아니요"
L["Обычный поиск"] = "일반 검색"
L["Обязательное поле \"Имя фильтра\", пустые текстовые поля не используются при фильтрации."] = "필수 필드 \"필터 이름\",\n 전체 텍스트 필드는 필터링 중에 사용되지 않습니다."
L["Откл."] = "끄기"
L["Отклонить"] = "거절"
L["Поле может содержать только буквы"] = "필드는 문자만 포함 할 수 있습니다."
L["Пригласить"] = "초대"
L["Пригласить: %u"] = "초대: %u"
L["Расширенное сканирование"] = "확장 스캔"
L["Расы:"] = "종족:"
L["Режим приглашения"] = "초대 모드"
L["Сбросить"] = "재설정"
L["Слово NAME заглавными буквами будет заменено на название вашей гильдии."] = "대문자로 된 NAME 단어가 길드 이름으로 대체됩니다."
L["Сохранить"] = "저장"
L["Текущее сообщение: %s"] = "현재 메시지: %s"
L["Удалить"] = "삭제"
L["Умный поиск"] = "스마트 검색"
L["Фильтр классов начало:"] = "클래스 필터 시작:"
L["Фильтр по имени"] = "이름으로 필터링"
L["Фильтр повторений в имени"] = "이름 반복 필터"
L["Фильтр рас начало:"] = "종족 필터 시작:"
L["Фильтры"] = "필터"
L["Числа должны быть больше 0"] = "숫자는 0보다 커야합니다."
L["Числа не могут быть меньше или равны 0. Минимальный уровень не может быть больше максимального"] = "숫자는 0보다 작거나 같을 수 없습니다. 최소 레벨은 최대 값보다 클 수 없습니다."
L["Чтобы быть отфильтрованным, игрок должен соответствовать критериям ВСЕХ фильтров"] = "필터링하려면 플레이어가 모든 필터 기준을 충족해야합니다."
L["tooltip"] = {
	["Автоматическое увеличение детализации поиска"] = "검색 세부 정보 자동 증가",
	["Введите диапазон уровней для фильтра.\nНапример: %s55%s:%s58%s\nбудут подходить только те игроки, уровень\nкоторых варьируется от %s55%s до %s58%s (включительно)"] = "필터의 레벨 범위를 입력하십시오.\n예:%s55%s:%s58%s\n 그 플레이어만 접근합니다.\n%s55%s에서 %s58%s까지 다양합니다.(포함)",
	["Введите максимальное количество последовательных\nгласных и согласных, которое может содержать имя игрока.\nНапример: %s3%s:%s5%s\nБудет означать, что игроки с более чем %s3%s гласными подряд\nили более %s5%s согласными подряд не будут добавлены в очередь."] = "연속되는 최대 자음과 자음의 수를 입력하십시오. 여기에는 플레이어의 이름이 포함될 수 있습니다.\n예:%s3%s:%s5%s\n 행에 %s3%s 이상의 모음이있는 플레이어가 \n%s5%s 이상의 행에 대기열에 추가되지 않습니다.",
	["Дополнительные настройки сканирования"] = "고급 스캔 설정",
	["Если имя игрока содержит введенную\nфразу, он не будет добавлен в очередь"] = "플레이어 이름에 입력 된 \nфразу이 있으면 대기열에 추가되지 않습니다.",
	["Запускать поиск в фоновом режиме"] = "백그라운드 검색 실행",
	["Количество уровней сканируемых за один раз"] = "한 번에 스캔 할 레벨 수",
	["Назначить клавишу для приглашения"] = "초대장에 키 지정",
	["Не отображать в чате отправляемые сообщения"] = "채팅에서 보낸 메시지 표시 안 함",
	["Не отображать в чате системные сообщения"] = "채팅에 시스템 메시지를 표시하지 마십시오.",
	["Не отображать в чате сообщения аддона"] = "부가 기능 채팅 메시지 표시 안 함",
	["Уровень, с которого начинается фильтр по классам"] = "클래스에 의해 필터가 시작되는 레벨입니다.",
	["Уровень, с которого начинается фильтр по расам"] = "클래스에 의해 필터가 시작되는 레벨",
}
L["invType"] = {
	[1] = "초대만",
	[2] = "메시지 보내기 및 초대",
	[3] = "메시지만",
}

-- SYSTEM
L[" c-"] = "c-"
L[" r-"] = "r-"
L["class"] = {
	["DeathKnight"] = "죽음의 기사",
	["DemonHunter"] = "악마 사냥꾼",
	["Druid"] = "드루이드",
	["Hunter"] = "사냥꾼",
	["Mage"] = "마법사",
	["Monk"] = "수도사",
	["Paladin"] = "성기사",
	["Priest"] = "사제",
	["Rogue"] = "도적",
	["Shaman"] = "주술사",
	["Warlock"] = "흑마법사",
	["Warrior"] = "전사",
}
L["race"] = {
	["Horde"] = {
		["BloodElf"] = "블러드 엘프",
		["Goblin"] = "고블린",
		["HightmountainTauren"] = "높은산 타우렌",
		["MagharOrc"] = "마그하르 오크",
		["Nightborne"] = "나이트본",
		["Orc"] = "오크",
		["Pandaren"] = " 판다렌",
		["Tauren"] = "타우렌",
		["Troll"] = "트롤",
		["Undead"] = "언데드",
	},
	["Alliance"] = {
		["DarkIronDwarf"] = "검은무쇠 드워프",
		["Draenei"] = "드레나이",
		["Dwarf"] = "드워프",
		["Gnome"] = "노움",
		["Human"] = "인간",
		["LightforgedDraenei"] = "빛벼림 드레나이",
		["NightElf"] = "나이트 엘프",
		["Pandaren"] = "판다렌",
		["VoidElf"] = "공허 엘프",
		["Worgen"] = "늑대인간",
	},
}